Documents/Реализация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Реализация</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказНаряд</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.МатериалыЗаказчиков</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
				<xr:Item>AccumulationRegister.УчетЗатрат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МатериалыЗаказчика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеМатериала</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияМатериаловКлиентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/УчетЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>УчетЗатрат</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыКлиентов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/МатериалыЗаказчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>МатериалыЗаказчиков</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитика</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособУчетаЗапасов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСписанияЗапасов</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыСписанияЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыСписанияЗапасов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FEFO</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Реализация/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
		
		Контрагент = ДанныеЗаполнения.Клиент;
		Автомобиль = ДанныеЗаполнения.Автомобиль;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		Склад = ДанныеЗаполнения.Склад;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		
		Комментарий = "Введен на основании: Заказ-наряд № " + ДанныеЗаполнения.Номер + " от " + Формат(ДанныеЗаполнения.Дата, "ДФ=dd.MM.yyyy");
		
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.Услуги Цикл
			
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.Услуга= ТекСтрокаУслуги.Услуга;
			НоваяСтрока.Количество = ТекСтрокаУслуги.Количество;
			НоваяСтрока.Цена= ТекСтрокаУслуги.Цена;
			НоваяСтрока.Сумма= ТекСтрокаУслуги.Сумма;
			
		КонецЦикла;
		
		
		Для Каждого ТекСтрокаМатериалы Из ДанныеЗаполнения.МатериалыЗаказчика Цикл
			
			НоваяСтрока = МатериалыЗаказчика.Добавить();
			НоваяСтрока.Номенклатура = ТекСтрокаМатериалы.Номенклатура;
			НоваяСтрока.СостояниеМатериала = ТекСтрокаМатериалы.СостояниеМатериала;
			НоваяСтрока.Количество = ТекСтрокаМатериалы.Количество;
			
		КонецЦикла;
		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	Движения.УчетЗатрат.Записывать = Истина;
	Движения.ЗаказыКлиентов.Записывать = Истина;
	Движения.МатериалыЗаказчиков.Записывать = Истина;
	Движения.Хозрасчетный.Записывать = Истина;
	
	
	Движения.ТоварыНаСкладах.Записать();
	Движения.Продажи.Записать();
	Движения.УчетЗатрат.Записать();
	Движения.ЗаказыКлиентов.Записать();
	Движения.МатериалыЗаказчиков.Записать();
	Движения.Хозрасчетный.Записать();
	
	
	
	Если Товары.Количество() > 0 Тогда
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
		ЭлементБлокировки.ИсточникДанных = Товары;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
		Блокировка.Заблокировать();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫБОР
	|		КОГДА УчетнаяПолитикаСрезПоследних.СпособУчетаЗапасов = ЗНАЧЕНИЕ(Перечисление.СпособыСписанияЗапасов.ПоСредней)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УчетнаяПолитикаПоСредней
	|ПОМЕСТИТЬ ВТ_УчетнаяПолитика
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика.СрезПоследних(&Период, ) КАК УчетнаяПолитикаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТовары.Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат,
	|	СУММА(РеализацияТовары.Количество) КАК КоличествоДок,
	|	СУММА(РеализацияТовары.Сумма) КАК СуммаДок
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.Реализация.Товары КАК РеализацияТовары
	|ГДЕ
	|	РеализацияТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТовары.Номенклатура,
	|	РеализацияТовары.Номенклатура.СтатьяЗатрат
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияУслуги.Услуга КАК Номенклатура,
	|	СУММА(РеализацияУслуги.Количество) КАК КоличествоДок,
	|	СУММА(РеализацияУслуги.Сумма) КАК СуммаДок
	|ПОМЕСТИТЬ ВТ_УслугиДокумента
	|ИЗ
	|	Документ.Реализация.Услуги КАК РеализацияУслуги
	|ГДЕ
	|	РеализацияУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияУслуги.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияМатериалыЗаказчика.Номенклатура КАК Номенклатура,
	|	СУММА(РеализацияМатериалыЗаказчика.Количество) КАК КоличествоДок
	|ПОМЕСТИТЬ ВТ_МатериалыДока
	|ИЗ
	|	Документ.Реализация.МатериалыЗаказчика КАК РеализацияМатериалыЗаказчика
	|ГДЕ
	|	РеализацияМатериалыЗаказчика.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияМатериалыЗаказчика.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.КоличествоДок КАК КоличествоДок,
	|	ВТ_Товары.СуммаДок КАК СуммаДок
	|ПОМЕСТИТЬ ВТ_ОбъединениеПродаж
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_УслугиДокумента.Номенклатура,
	|	ВТ_УслугиДокумента.КоличествоДок,
	|	ВТ_УслугиДокумента.СуммаДок
	|ИЗ
	|	ВТ_УслугиДокумента КАК ВТ_УслугиДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОбъединениеПродаж.Номенклатура КАК Номенклатура,
	|	СУММА(ВТ_ОбъединениеПродаж.КоличествоДок) КАК КоличествоДок,
	|	СУММА(ВТ_ОбъединениеПродаж.СуммаДок) КАК СуммаДок
	|ПОМЕСТИТЬ ВТ_ПродажиИтог
	|ИЗ
	|	ВТ_ОбъединениеПродаж КАК ВТ_ОбъединениеПродаж
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОбъединениеПродаж.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТ_Товары.КоличествоДок КАК КоличествоВДокументе,
	|	ВТ_Товары.СуммаДок КАК СуммаВДокументе,
	|	ВЫБОР
	|		КОГДА ВТ_УчетнаяПолитика.УчетнаяПолитикаПоСредней
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ ЕСТЬNULL(ТоварыНаСкладахОстатки.СрокГодности, ДАТАВРЕМЯ(1, 1, 1))
	|	КОНЕЦ КАК СрокГодности,
	|	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ТоварыНаСкладахОстатки.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&Период,
	|				(Номенклатура, Склад) В
	|					(ВЫБРАТЬ
	|						ВТ.Номенклатура,
	|						&Склад
	|					ИЗ
	|						ВТ_Товары КАК ВТ)) КАК ТоварыНаСкладахОстатки
	|		ПО ВТ_Товары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчетнаяПолитика КАК ВТ_УчетнаяПолитика
	|		ПО (ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Товары.Номенклатура,
	|	ВТ_Товары.СтатьяЗатрат,
	|	ВТ_Товары.КоличествоДок,
	|	ВТ_Товары.СуммаДок,
	|	ВЫБОР
	|		КОГДА ВТ_УчетнаяПолитика.УчетнаяПолитикаПоСредней
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ ЕСТЬNULL(ТоварыНаСкладахОстатки.СрокГодности, ДАТАВРЕМЯ(1, 1, 1))
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	СрокГодности
	|ИТОГИ
	|	МАКСИМУМ(КоличествоВДокументе),
	|	МАКСИМУМ(СуммаВДокументе),
	|	СУММА(КоличествоОстаток),
	|	СУММА(СуммаОстаток)
	|ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МатериалыДока.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ВТ_МатериалыДока.КоличествоДок) КАК КоличествоВДокументе,
	|	СУММА(МатериалыЗаказчиковОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	ВТ_МатериалыДока КАК ВТ_МатериалыДока
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.МатериалыЗаказчиков.Остатки(
	|				&Период,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							ВТ.Номенклатура
	|						ИЗ
	|							ВТ_МатериалыДока КАК ВТ)
	|					И Склад = &Склад
	|					И Заказчик = &Контрагент) КАК МатериалыЗаказчиковОстатки
	|		ПО ВТ_МатериалыДока.Номенклатура = МатериалыЗаказчиковОстатки.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_МатериалыДока.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПродажиИтог.Номенклатура КАК Номенклатура,
	|	ВТ_ПродажиИтог.КоличествоДок КАК КоличествоДок,
	|	ВТ_ПродажиИтог.СуммаДок КАК СуммаДок
	|ИЗ
	|	ВТ_ПродажиИтог КАК ВТ_ПродажиИтог";
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаЗатрат = Новый Соответствие;
	ВыборкаТовары = ПакетРезультатов[6].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТовары.Следующий() Цикл
		
		ОстатокНаСкладе = ?(ВыборкаТовары.КоличествоОстаток = Неопределено, 0, ВыборкаТовары.КоличествоОстаток);
		
		Дефицит = ВыборкаТовары.КоличествоВДокументе - ОстатокНаСкладе;
		Если Дефицит > 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Превышение остатка по номенклатуре ""%1"" в количестве %2 ед.", ВыборкаТовары.Номенклатура, Дефицит);
			Сообщение.Сообщить();
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		ОсталосьСписать = ВыборкаТовары.КоличествоВДокументе;
		ВыборкаПартий  = ВыборкаТовары.Выбрать();
		
		Пока ВыборкаПартий.Следующий() И ОсталосьСписать > 0 Цикл
			
			Доступно = ВыборкаПартий.КоличествоОстаток;
			Если Доступно = 0 Тогда Продолжить; КонецЕсли;
			
			Списываем = Мин(Доступно, ОсталосьСписать);
			
			Если Списываем = Доступно Тогда
				Себестоимость = ВыборкаПартий.СуммаОстаток;
			Иначе
				Себестоимость = Окр((ВыборкаПартий.СуммаОстаток / Доступно) * Списываем, 2);
			КонецЕсли;
			
			Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Склад = Склад;
			Движение.Номенклатура = ВыборкаПартий.Номенклатура;
			Движение.СрокГодности = ВыборкаПартий.СрокГодности;
			Движение.Количество = Списываем;
			Движение.Сумма = Себестоимость;
			
			ДвижениеБУ = Движения.Хозрасчетный.Добавить();
			ДвижениеБУ.Период = Дата;
			ДвижениеБУ.СчетДт = ПланыСчетов.Хозрасчетный.Продажи;
			ДвижениеБУ.СчетКт = ВыборкаПартий.Номенклатура.СчетБухгалтерскогоУчета;
			ДвижениеБУ.Сумма = Себестоимость;
			ДвижениеБУ.Содержание = "Списана себестоимость товарно-материальных ценностей";
			
			БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеБУ.СчетКт, ДвижениеБУ.СубконтоКт, ВыборкаПартий.Номенклатура);
			
			Статья = ВыборкаПартий.СтатьяЗатрат;
			Если ЗначениеЗаполнено(Статья) Тогда
				ТекущаяСумма = ТаблицаЗатрат.Получить(Статья);
				ТекущаяСумма = ?(ТекущаяСумма = Неопределено, 0, ТекущаяСумма);
				ТаблицаЗатрат.Вставить(Статья, ТекущаяСумма + Себестоимость);
			КонецЕсли;
			
			ОсталосьСписать = ОсталосьСписать - Списываем;
		КонецЦикла;
	КонецЦикла;
	
	Если Отказ Тогда Возврат; КонецЕсли;
	
	Для Каждого ЗаписьЗатрат Из ТаблицаЗатрат Цикл
		ДвижениеЗ = Движения.УчетЗатрат.Добавить();
		ДвижениеЗ.Период = Дата;
		ДвижениеЗ.СтатьяЗатрат = ЗаписьЗатрат.Ключ;
		ДвижениеЗ.Сумма = ЗаписьЗатрат.Значение;
	КонецЦикла;
	
	ВыборкаМатериалы = ПакетРезультатов[7].Выбрать();
	Пока ВыборкаМатериалы.Следующий() Цикл
		
		ДвижениеМ = Движения.МатериалыЗаказчиков.Добавить();
		ДвижениеМ.ВидДвижения = ВидДвиженияНакопления.Расход;
		ДвижениеМ.Период = Дата;
		ДвижениеМ.Склад = Склад;
		ДвижениеМ.Заказчик = Контрагент;
		ДвижениеМ.Номенклатура = ВыборкаМатериалы.Номенклатура;
		ДвижениеМ.Количество = ВыборкаМатериалы.КоличествоВДокументе;
	КонецЦикла;
	
	ВыборкаПродаж = ПакетРезультатов[8].Выбрать();
	Пока ВыборкаПродаж.Следующий() Цикл
		ДвижениеП = Движения.Продажи.Добавить();
		ДвижениеП.Период = Дата;
		ДвижениеП.Номенклатура = ВыборкаПродаж.Номенклатура;
		ДвижениеП.Контрагент = Контрагент;
		ДвижениеП.Сотрудник = Сотрудник;
		ДвижениеП.Количество = ВыборкаПродаж.КоличествоДок;
		ДвижениеП.Сумма = ВыборкаПродаж.СуммаДок;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		СуммаУслуг = Услуги.Итог("Сумма");
		Если СуммаУслуг > 0 Тогда
			ДвижениеЗК = Движения.ЗаказыКлиентов.Добавить();
			ДвижениеЗК.ВидДвижения = ВидДвиженияНакопления.Расход;
			
			ДвижениеЗК.Период = Дата;
			ДвижениеЗК.Клиент = Контрагент;
			ДвижениеЗК.ЗаказКлиента = ДокументОснование; 
			ДвижениеЗК.Сумма = СуммаУслуг;
		КонецЕсли;
	КонецЕсли;
	
	Если СуммаДокумента > 0 Тогда
		ДвижениеВыручка = Движения.Хозрасчетный.Добавить();
		ДвижениеВыручка.Период = Дата;
		ДвижениеВыручка.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
		ДвижениеВыручка.СчетКт = ПланыСчетов.Хозрасчетный.Продажи;
		ДвижениеВыручка.Сумма = СуммаДокумента;
		ДвижениеВыручка.Содержание = "Отражена выручка от реализации товаров и услуг";
		
		БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеВыручка.СчетДт, ДвижениеВыручка.СубконтоДт, Контрагент);
	КонецЕсли;
	
	
КонецПроцедуры
